In [14]:
!pip install openpyxl

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: openpyxl in c:\users\abuzer\appdata\roaming\python\python312\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\abuzer\appdata\roaming\python\python312\site-packages (from openpyxl) (2.0.0)

[notice] A new release of pip is available: 24.0 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [12]:
df = pd.read_csv("stock_data.csv")
df

,Datasource: Google finance,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4
0,tickers,eps,revenue,price,people
1,GOOGL,27.82,87,845,larry page
2,WMT,4.61,484,65,n.a.
3,MSFT,-1,85,64,bill gates
4,RIL,not available,50,1023,mukesh ambani
5,TATA,5.6,-1,n.a.,ratan tata

In [23]:
df = pd.read_csv("stock_data.csv" , skiprows=1)
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [39]:
df.set_index("tickers" , inplace =True)
df.head()

                   eps  revenue price         people
tickers
GOOGL            27.82       87   845     larry page
WMT               4.61      484    65           n.a.
MSFT                -1       85    64     bill gates
RIL      not available       50  1023  mukesh ambani
TATA               5.6       -1  n.a.     ratan tata

In [40]:
df.index

Index(['GOOGL', 'WMT', 'MSFT', 'RIL ', 'TATA'], dtype='object', name='tickers')

In [41]:
df.reset_index( "tickers" , inplace= True)
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [42]:
df.reset_index( drop=True , inplace= True)
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [38]:
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [ ]:
# simple drop the unwanted column from the csv file
df.drop(columns=['level_0', 'index'], inplace=True)

In [62]:
df = pd.read_csv("stock_data.csv" , skiprows=1 , names=["Stock_symbol" , "eps", "revenue", "price", "people"] , nrows=5 )
df

  Stock_symbol            eps  revenue  price         people
0      tickers            eps  revenue  price         people
1        GOOGL          27.82       87    845     larry page
2          WMT           4.61      484     65           n.a.
3         MSFT             -1       85     64     bill gates
4         RIL   not available       50   1023  mukesh ambani

In [70]:
# for removing and change not available value with NAN
df = pd.read_csv("stock_data.csv", skiprows=1 , na_values={
    "eps": ["not available"],
    "revenue": [-1]
})
df

  tickers    eps  revenue price         people
0   GOOGL  27.82     87.0   845     larry page
1     WMT   4.61    484.0    65           n.a.
2    MSFT  -1.00     85.0    64     bill gates
3    RIL     NaN     50.0  1023  mukesh ambani
4    TATA   5.60      NaN  n.a.     ratan tata

In [93]:
df = pd.read_csv("stock_data.csv", skiprows=1 , na_values=["not available", -1 , "n.a."] ) 
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT    NaN     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [96]:
df["pe"] = df["price"] / df["eps"]

  tickers    eps  revenue   price         people         pe
0   GOOGL  27.82     87.0   845.0     larry page  30.373832
1     WMT   4.61    484.0    65.0            NaN  14.099783
2    MSFT    NaN     85.0    64.0     bill gates        NaN
3    RIL     NaN     50.0  1023.0  mukesh ambani        NaN
4    TATA   5.60      NaN     NaN     ratan tata        NaN

In [98]:
df

  tickers    eps  revenue   price         people         pe
0   GOOGL  27.82     87.0   845.0     larry page  30.373832
1     WMT   4.61    484.0    65.0            NaN  14.099783
2    MSFT    NaN     85.0    64.0     bill gates        NaN
3    RIL     NaN     50.0  1023.0  mukesh ambani        NaN
4    TATA   5.60      NaN     NaN     ratan tata        NaN

In [105]:
df.to_csv("pe.csv" ,index=False , header=False)

In [89]:
# df.isna().sum() ye bata hai kii kitan na value